using System; 

namespace HomeWork4
{
    /*
    Дан массив и число. Найдите три числа в массиве сумма 
    которых равна искомому числу. Подсказка: если взять 
    первое число в массиве, можно ли найти в оставшейся 
    его части два числа равных по сумме первому.
    */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello");
        }
    }
}